<a href="https://colab.research.google.com/github/mefrem/DS-Unit-1-Sprint-2-Data-Wrangling-and-Storytelling/blob/master/module1-join-and-reshape-data/LS_DS_121_Join_and_Reshape_Data_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

_Lambda School Data Science_

# Join and Reshape datasets

Objectives
- concatenate data with pandas
- merge data with pandas
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- Pandas Documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

Making a change for commit and pull request

In [1]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

--2019-09-09 20:05:14--  https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.216.97.237
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.216.97.237|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 205548478 (196M) [application/x-gzip]
Saving to: ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’

instacart_online_gr 100%[===================>] 196.03M  33.9MB/s    in 6.4s

2019-09-09 20:05:21 (30.5 MB/s) - ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’ saved [205548478/205548478]

In [2]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

instacart_2017_05_01/
instacart_2017_05_01/._aisles.csv
instacart_2017_05_01/aisles.csv
instacart_2017_05_01/._departments.csv
instacart_2017_05_01/departments.csv
instacart_2017_05_01/._order_products__prior.csv
instacart_2017_05_01/order_products__prior.csv
instacart_2017_05_01/._order_products__train.csv
instacart_2017_05_01/order_products__train.csv
instacart_2017_05_01/._orders.csv
instacart_2017_05_01/orders.csv
instacart_2017_05_01/._products.csv
instacart_2017_05_01/products.csv

In [3]:
%cd instacart_2017_05_01

/content/instacart_2017_05_01

In [4]:
!ls -lh *.csv

-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

# Assignment

## Join Data Practice

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

In [5]:
##### YOUR CODE HERE #####
# I think at a minimum, we need the order_id, product_id, and product_name
# The most relevant dataframes are order_products__prior, order_products__train, as well as orders and products.
# We will concatenate the first two.
# Then merge them sequentially.

import pandas as pd
order_products__prior = pd.read_csv('order_products__prior.csv')
order_products__train = pd.read_csv('order_products__train.csv')
order_products = pd.concat([order_products__prior, order_products__train])
print(order_products.shape)

(33819106, 4)

In [7]:
# Dropping extraneous columns
order_products.drop(['add_to_cart_order','reordered'], axis=1, inplace=True)
order_products.head(1)

   order_id  product_id
0         2       33120

In [8]:
orders = pd.read_csv('orders.csv')
#Dropping extraneous columns
orders.drop(['eval_set','order_dow','order_hour_of_day','days_since_prior_order'], axis=1, inplace=True)
orders.head(1)

   order_id  user_id  order_number
0   2539329        1             1

In [0]:
merged = pd.merge(order_products,orders, how='outer', on='order_id')

In [10]:
merged.head()

   order_id  product_id  user_id  order_number
0         2     33120.0   202279             3
1         2     28985.0   202279             3
2         2      9327.0   202279             3
3         2     45918.0   202279             3
4         2     30035.0   202279             3

In [18]:
products = pd.read_csv('products.csv')
# Drop extraneous columns
products.drop(['aisle_id','department_id'], axis=1,inplace=True)
print(products.shape)
products.head()

(49688, 2)

   product_id                                       product_name
0           1                         Chocolate Sandwich Cookies
1           2                                   All-Seasons Salt
2           3               Robust Golden Unsweetened Oolong Tea
3           4  Smart Ones Classic Favorites Mini Rigatoni Wit...
4           5                          Green Chile Anytime Sauce

In [59]:
# Our final dataframe for counting frequencies
final = pd.merge(merged,products, how='outer',on='product_id')
final.head()

   order_id  product_id   user_id  order_number        product_name
0       2.0     33120.0  202279.0           3.0  Organic Egg Whites
1      26.0     33120.0  153404.0           2.0  Organic Egg Whites
2     120.0     33120.0   23750.0          11.0  Organic Egg Whites
3     327.0     33120.0   58707.0          21.0  Organic Egg Whites
4     390.0     33120.0  166654.0          48.0  Organic Egg Whites

In [81]:
# Let's show value counts by product_id, show the top 10. then call the index of that table, which
# should be a list of the unique product_id
top_10 = final.product_id.value_counts().head(10)

# Let's create a DataFrame with that table, where column 1 is the product_id and the value_counts are now
# frequency. Let's force an int since the DataFrame was getting populated with floats
top_products = top_10.rename_axis('product_id').reset_index(name='frequency').astype(int)
top_products.head(10)

   product_id  frequency
0       24852     491291
1       13176     394930
2       21137     275577
3       21903     251705
4       47209     220877
5       47766     184224
6       47626     160792
7       16797     149445
8       26209     146660
9       27845     142813

In [45]:
products.head()

   product_id                                       product_name
0           1                         Chocolate Sandwich Cookies
1           2                                   All-Seasons Salt
2           3               Robust Golden Unsweetened Oolong Tea
3           4  Smart Ones Classic Favorites Mini Rigatoni Wit...
4           5                          Green Chile Anytime Sauce

In [82]:
# Then let's merge a new list, the DataFrame of frequency counts above with the products name dataframe
names_top_10 = pd.merge(top_products,products, how='outer',on='product_id')
# Here are the names of our top products.
names_top_10.head(10)

   product_id  frequency            product_name
0       24852   491291.0                  Banana
1       13176   394930.0  Bag of Organic Bananas
2       21137   275577.0    Organic Strawberries
3       21903   251705.0    Organic Baby Spinach
4       47209   220877.0    Organic Hass Avocado
5       47766   184224.0         Organic Avocado
6       47626   160792.0             Large Lemon
7       16797   149445.0            Strawberries
8       26209   146660.0                   Limes
9       27845   142813.0      Organic Whole Milk

## Reshape Data Section

- Replicate the lesson code
- Complete the code cells we skipped near the beginning of the notebook
- Table 2 --> Tidy
- Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [0]:
%matplotlib inline
import pandas as pd
import numpy as np
import seaborn as sns

table1 = pd.DataFrame(
    [[np.nan, 2],
     [16,    11], 
     [3,      1]],
    index=['John Smith', 'Jane Doe', 'Mary Johnson'], 
    columns=['treatmenta', 'treatmentb'])

table2 = table1.T

In [84]:
table1

              treatmenta  treatmentb
John Smith           NaN           2
Jane Doe            16.0          11
Mary Johnson         3.0           1

In [85]:
table2

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

Table 1 --> Tidy

In [86]:
table1 = table1.reset_index()
table1

          index  treatmenta  treatmentb
0    John Smith         NaN           2
1      Jane Doe        16.0          11
2  Mary Johnson         3.0           1

In [101]:
tidy_table1 = table1.melt(id_vars='index',value_vars=['treatmenta','treatmentb'])
tidy_table1

          index    variable  value
0    John Smith  treatmenta    NaN
1      Jane Doe  treatmenta   16.0
2  Mary Johnson  treatmenta    3.0
3    John Smith  treatmentb    2.0
4      Jane Doe  treatmentb   11.0
5  Mary Johnson  treatmentb    1.0

In [106]:
tidy_table1 = tidy_table1.rename(columns={
    'index':'name',
    'variable':'trt',
    'value':'result'
})
tidy_table1
tidy_table1.trt = tidy_table1.trt.str.replace('treatment','')
tidy_table1
# Viola! Hadley Wickham's version.

           name trt  result
0    John Smith   a     NaN
1      Jane Doe   a    16.0
2  Mary Johnson   a     3.0
3    John Smith   b     2.0
4      Jane Doe   b    11.0
5  Mary Johnson   b     1.0

In [116]:
wide = tidy_table1.pivot_table(index='name',columns='trt', values='result')
wide

trt              a     b
name
Jane Doe      16.0  11.0
John Smith     NaN   2.0
Mary Johnson   3.0   1.0

In [121]:
# Now let's tidy table2
table2

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [133]:
temp_table2 = table2.reset_index()

        index  John Smith  Jane Doe  Mary Johnson
0  treatmenta         NaN      16.0           3.0
1  treatmentb         2.0      11.0           1.0

In [173]:
# Our tidy table 2, the result of a .melt method 
tidy_table2 = temp_table2.melt(id_vars='index',value_vars=['John Smith', 'Jane Doe','Mary Johnson'])
tidy_table2 = tidy_table2.rename(columns={'index':'trt','variable':'name','value':'result'}).sort_values(['trt'])
tidy_table2

          trt          name  result
0  treatmenta    John Smith     NaN
2  treatmenta      Jane Doe    16.0
4  treatmenta  Mary Johnson     3.0
1  treatmentb    John Smith     2.0
3  treatmentb      Jane Doe    11.0
5  treatmentb  Mary Johnson     1.0

In [174]:
# Recreating table2
wide = tidy_table2.pivot_table(index='name', columns='trt', values='result')
wide

trt           treatmenta  treatmentb
name
Jane Doe            16.0        11.0
John Smith           NaN         2.0
Mary Johnson         3.0         1.0

In [0]:
flights = sns.load_dataset('flights')

- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [163]:
##### YOUR CODE HERE #####
flights.head()
flights_pivot = flights.pivot_table(index='year',columns='month')
flights_pivot

      passengers                       ...
month    January February March April  ... September October November December
year                                   ...
1949         112      118   132   129  ...       136     119      104      118
1950         115      126   141   135  ...       158     133      114      140
1951         145      150   178   163  ...       184     162      146      166
1952         171      180   193   181  ...       209     191      172      194
1953         196      196   236   235  ...       237     211      180      201
1954         204      188   235   227  ...       259     229      203      229
1955         242      233   267   269  ...       312     274      237      278
1956         284      277   317   313  ...       355     306      271      306
1957         315      301   356   348  ...       404     347      305      336
1958         340      318   362   348  ...       404     359      310      337
1959         360      342   406   396  ...       463     407      362      405
1960         417      391   419   461  ...       508     461      390      432

[12 rows x 12 columns]

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

In [0]:
##### YOUR CODE HERE #####
products = pd.read_csv('products.csv')

order_products = pd.concat([pd.read_csv('order_products__prior.csv'), 
                            pd.read_csv('order_products__train.csv')])

orders = pd.read_csv('orders.csv')

In [176]:
order_products.drop(['add_to_cart_order','reordered'], axis=1, inplace=True)

orders.drop(['eval_set','order_dow','days_since_prior_order'], axis=1, inplace=True)

merged = pd.merge(order_products,orders, how='outer', on='order_id')

products.drop(['aisle_id','department_id'], axis=1,inplace=True)

final = pd.merge(merged,products, how='outer',on='product_id')

final.head(2)

   order_id  product_id  ...  order_hour_of_day        product_name
0       2.0     33120.0  ...                9.0  Organic Egg Whites
1      26.0     33120.0  ...               16.0  Organic Egg Whites

[2 rows x 6 columns]

In [0]:
# Creating most popular products dataframe (if ordered more than 2900 times)
products_by_frequency = final.product_id.value_counts()
products_by_frequency = products_by_frequency.rename_axis('product_id').reset_index(name='frequency').astype(int)
popular_products = products_by_frequency.loc[products_by_frequency['frequency'] > 2900]
# popular_products

In [200]:
df = pd.merge(final,popular_products, how='outer',on='product_id')
condition2 = (df['frequency'] >= 2900)
df = df[condition2]

(22450886, 7)

In [207]:
# Here is the top 25 popularly ordered items that have the highest average "order_hour_of_day" value.
df.groupby('product_name').mean().sort_values('order_hour_of_day', ascending=False).head(25)

                                                  order_id  ...  frequency
product_name                                                ...
Half Baked Frozen Yogurt                      1.709979e+06  ...     2983.0
The Tonight Dough™ Ice Cream                  1.710629e+06  ...     3137.0
Americone Dream® Ice Cream                    1.707003e+06  ...     6447.0
Half Baked® Ice Cream                         1.697562e+06  ...     6222.0
Phish Food® Ice Cream                         1.722130e+06  ...     3177.0
Milk and Cookies Ice Cream                    1.703600e+06  ...     5223.0
Sicilian Pistachio                            1.718808e+06  ...     3146.0
Chocolate Peanut Butter Cup Gelato            1.750513e+06  ...     4511.0
Birthday Cake Light Ice Cream                 1.722630e+06  ...     5462.0
Cherry Garcia Ice Cream                       1.711088e+06  ...     4495.0
Strawberry Ice Cream                          1.702488e+06  ...     6409.0
Vanilla Bean Light Ice Cream                  1.675462e+06  ...     5096.0
Coffee Ice Cream                              1.719317e+06  ...     3941.0
Roman Raspberry Sorbetto                      1.693957e+06  ...     3179.0
Mediterranean Mint Gelato                     1.704625e+06  ...     7656.0
Caramel Cookie Crunch Gelato                  1.722033e+06  ...     5717.0
Chocolate Chip Cookie Dough Ice Cream         1.699407e+06  ...     8555.0
Mint Chip                                     1.730589e+06  ...     5871.0
Coconut Almond Minis Frozen Dessert Bars      1.706274e+06  ...     3460.0
Mint Chocolate Chip Ice Cream                 1.727455e+06  ...     3578.0
Chocolate Peanut Butter Ice Cream             1.747070e+06  ...     3653.0
Vanilla Milk Chocolate Almond Ice Cream Bars  1.699342e+06  ...     4290.0
Sea Salt Caramel Gelato                       1.737457e+06  ...     6973.0
Vanilla Bean Ice Cream                        1.712352e+06  ...     4644.0
Rising Crust Pepperoni Pizza                  1.732711e+06  ...     3863.0

[25 rows x 6 columns]

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)